Documents/АР17_РеестрПереданныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_РеестрПереданныхДокументов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АР17_ПереданныеДокументы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
								<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВручения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыУслуг</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АР17_РеестрПереданныхДокументов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АР17_СчетНаАрендуСостав.Ссылка КАК Документ,
	               |	АР17_СчетНаАрендуСостав.Ссылка.Контрагент КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |			ТОГДА ""Постоянная часть оплаты""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ АР17_СчетНаАрендуСостав.Номенклатура.АР_КоммунальныеУслуги
	               |						И НЕ АР17_СчетНаАрендуСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ""Переменная часть оплаты""
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА АР17_СчетНаАрендуСостав.Номенклатура.АР_КоммунальныеУслуги
	               |							ТОГДА ""Коммунальные услуги""
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ПараметрыУслуг
	               |ИЗ
	               |	Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО АР17_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ
	               |	И АР17_СчетНаАрендуСостав.Ссылка.Проведен = ИСТИНА
	               |	И АР17_СчетНаАрендуСостав.Ссылка.НачалоПериода = &НачалоПериода
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_СчетНаАрендуСостав.Ссылка.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |	И АР17_СчетНаАрендуСостав.Ссылка.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка,
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка.Контрагент,
	               |	ВЫБОР
	               |		КОГДА АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |			ТОГДА ""Постоянная часть оплаты""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_КоммунальныеУслуги
	               |						И НЕ АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_ПостояннаяЧастьОплаты
	               |					ТОГДА ""Переменная часть оплаты""
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА АР17_НачислениеАренднойПлатыСостав.Номенклатура.АР_КоммунальныеУслуги
	               |							ТОГДА ""Коммунальные услуги""
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР17_НачислениеАренднойПлатыСостав
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ПО АР17_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ИК = ЗНАЧЕНИЕ(Справочник.АР_объектыАренды.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_ЗаключениеДоговораАренды.ИК = &ИК
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ АР17_НачислениеАренднойПлатыСостав.Контрагент = &Контрагент
	               |		КОНЕЦ
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.Проведен = ИСТИНА
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.НачалоПериода = &НачалоПериода
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.Организация = &Организация";
	Запрос.УстановитьПараметр("ИК",Объект.ИК);
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода",Объект.ДатаНачалаПериода);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выгрузка.Сортировать("Контрагент");
	Объект.Состав.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаНачалаПериода = НачалоМесяца(ТекущаяДата());
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ДатаНачалаПериода", "ПериодРегистрацииСтрокой"); 
		Объект.Ответственный   = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры
